/* Чечулин Денис
 *  
 * 3. 
 * 
 * Переделать программу Пример использования коллекций для решения следующих задач:
 * а) Подсчитать количество студентов учащихся на 5 и 6 курсах; +
 * б) подсчитать сколько студентов в возрасте от 18 до 20 лет на каком курсе учатся (*частотный массив); + 
 * в) отсортировать список по возрасту студента; +
 * г) *отсортировать список по курсу и возрасту студента; +
 * 
 */

namespace Task_6._1
{
    class Program
    {
        static void Main(string[] args)
        {
            Application application = new Application();
            application.Start();
            application.Close();
        }
    }
}
